app/Http/Controllers/QuestionsController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `questions`
---
    public function index()
    {
        $questions = Question::latest()->paginate(5);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-01-20 15:12:36' where `id` = 6
---
    public function show(Question $question)
    {
        $question->increment('views');

update `questions` set `title` = 'First Title', `slug` = 'first-title', `questions`.`updated_at` = '2020-01-21 08:26:08' where `id` = 14
---
    public function update(AskQuestionRequest $request, Question $question)
    {
        $question->update($request->only('title','body'));

delete from `questions` where `id` = 17
---
    public function destroy(Question $question)
    {
        $question->delete();