app/Providers/RouteServiceProvider.php

    public function boot()
    {
        Route::bind('slug', function($slug) {
            return Question::with('answers.user')->where('slug',$slug)->first() ?? abort(404);
---
select * from `questions` where `slug` = 'rerum-sapiente-laboriosam-pariatur-reprehenderit-est-quam-illum-mollitia-dicta-et-dignissimos' limit 1